"""створити программу
симуляция роботи магичної скриньки
замкнена магічним замком
скринька відкрита при виконнані певних умов

класс скринька
перелік складових
метод адд айтем
опен чест

ключ повинен бути довжиною 8 символів
1 літера верхнього регістра, 1 нижня і 1 цифра
якщо ключ не відповідає вимогам, формується виняток,
інвавід кей експепшен спадкування від кей ексшепшен

користувачь вводить певний ключ перевіряє
повідомляє про причину і дає змогу ввести ще раз
"""


class MagicBox:

    def __init__(self):
        self.__box = ()
        self.magic_key = ""

    def add_item(self, item):
        self.__box.__add__(item)

    def open_chest(self, magic_key: str):
        self.magic_key = magic_key

        box = self.__box
        pass


class InvalidKeyException(Exception):
    pass

